jAc0ob/RuView/firmware/esp32-hello-world/sdkconfig.defaults
# ESP32 Hello World — SDK Configuration (default: ESP32 DevKitV1)
CONFIG_IDF_TARGET="esp32"

# Flash: 4MB (standard DevKitV1 flash size)
CONFIG_ESPTOOLPY_FLASHSIZE_4MB=y
CONFIG_ESPTOOLPY_FLASHSIZE="4MB"

# Enable WiFi CSI so we can probe it
CONFIG_ESP_WIFI_CSI_ENABLED=y

# Verbose logging so user sees everything
CONFIG_LOG_DEFAULT_LEVEL_INFO=y

# Bigger main task stack for printf-heavy capability dump
CONFIG_ESP_MAIN_TASK_STACK_SIZE=8192
